import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';

class AlamuSwalathScreen extends StatefulWidget {
  const AlamuSwalathScreen({super.key});

  @override
  State<AlamuSwalathScreen> createState() => _AlamuSwalathScreenState();
}

class _AlamuSwalathScreenState extends State<AlamuSwalathScreen> {
  final ScrollController _scrollController = ScrollController();
  
  final String arabicText = 'َاَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الْمُرْسَلِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَ مُحَمَّدٍ سَيِّدِ الْمُجَاهِدِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الشَّاهِدِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الْخآئِفِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِالطَّائِعِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الـتّـآئِبِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الْعَابِدِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الْحَامِدِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الصَّالِحِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الرَّاآِعِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ السَّاجِدِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الْقآئِمِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الْقآئِدِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الْمُتَّقِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الْمُسْتَغْفِرِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ النَّادِمِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الشَّاآِرِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الْحَافِظِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الذَّاآِرِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الْعَاقِلِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الْمُحْسِنِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ اْلاَآْرَمِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الْمُنْذِرِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الْمُبَشِّرِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ الطَّيِّبِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ النَّبِيِّينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ النَّبِيِّ الزَّآِيِّ التَّقِيِّ* اَللَّهُمَّ صَلِّ وَسَلِّمْ نِ الْعَالَمِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ الْمَدَنِيِّ نِ القُرَشِيِّ الْهَاشِمِيِّ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ نِ عَلَي سَيِّدِنَا مُحَمَّدٍ الْعَرَبِيِّ الْمُكَرَّمِ يَوْمَ القِيَامَةِ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ سَيِّدِ اَهْلِ الْجَنَّةِ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ صَاحِبِ الْمَقَامِ الْمَحْمُودِ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ صَاحِبِ الصِّرَاطِ الْمُسْتَقِيمِ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ اَفْضَلِ اْلاَوَّلِينَ وَاْلآخِرِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي سَيِّدِنَا مُحَمَّدٍ وَعَلَى جَمِيعِ الْمَلآئِكَةِ الْمُقَرَّبِينَ*وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي مَنْ سَمَّيْتَهُ ذَاآِرًاوَحَبِيبًا وَمُذَآِّرًا مُحَمَّدٍ رَسُولِ االلهِ* اَللَّهُمَّ صَلِّ وَسَلِّمْ عَلَي مَنْ سَمَّيْتَهُ اَحْمَدًا وَمُحَمَّدًا وَسَيِّدًا مُحَمَّدٍ رَّسُولِ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ صَابِرًا وَنَبِيا وَمُرَاقِبًا مُحَمَّدٍ رَّسُولِ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ عَالِيًا وَرَحِيمًا مُحَمَّدٍ رَّسُولِ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ عَاقِبًا وَآَرِيمًا مُحَمَّدٍ رَّسُولِ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ عَدْلاً وَجَوَادًا وَمُزَمِّلاً مُحَمَّدٍ رَّسُولِ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ قَاسِمًا وَمَهْدِيا وَهَادِيًا مُحَمَّدٍ رَّسُولِ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ شَكُورًا وَحَرِيصًا مُحَمَّدٍ رَّسُولِ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ قآئِمًا وَصَفِيا وَعَبْدَ االلهِ مُحَمَّدِ رَّسُولِ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ شَاهِدًا بَصِيرًا وَمَهْدِيا مُحَمَّدٍ رَّسُولِ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ بَاهِيًا وَنُورًا مَكِّـيا مُحَمَّدٍ رَّسُولِ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ شَاآِرًا وَوَلِيا وَنَذِيرًا مُحَمَّدٍ رَّسُولِ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ بُرْهَانًا صَحِيحًا وَشَرِيفًا مُحَمَّدٍ رَّسُولِ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُطَاهِرًا وَصَفِيا وَمُخْتَارًا مُحَمَّدٍ رَّسُولِ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ مُسْلِمًا وَرَؤُفًا مُحَمَّدٍ رَّسُولُ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ مُؤْمِنًا وَحَلِيمًا مُحَمَّدٍ رَّسُولِ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ قآئِمًا وَمَحْمُودًا وَحَامِدًا مُحَمَّدٍ رَّسُولُ االلهِ* اَللَّهُمَّ صَلِّ عَلَي مَنْ سَمَّيْتَهُ مِصْبَاحًا وَ آمِرًا وَنَاهِيًا مُحَمَّدٌ رَّسُولُ االلهِ صَلَّى االلهُ عَلَيْهِ وَعَلَى آلِهِ وَصَحْبِهِ وَاَزْوَاجِهِ وَذُرِّيَّاتِهِ وَاَهْلِ بَيْتِهِ وَعَنْ آُلِّ الصَّحَابَةِ اَجْمَعِينَ آمِينَ*';

  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.ltr,
      child: Scaffold(
        backgroundColor: const Color(0xFFF8F3E3),
        body: NestedScrollView(
          controller: _scrollController,
          headerSliverBuilder: (context, innerBoxIsScrolled) {
            return <Widget>[
              SliverAppBar(
                backgroundColor: const Color(0xFFF8F3E3),
                elevation: 0,
                pinned: true,
                expandedHeight: 30,
                collapsedHeight: 30,
                toolbarHeight: 30,
                leading: IconButton(
                  icon: const Icon(Icons.arrow_back, color: Colors.black),
                  onPressed: () => Navigator.of(context).pop(),
                ),
              ),
            ];
          },
          body: SafeArea(
            child: Padding(
              padding: const EdgeInsets.all(6),
              child: Container(
                decoration: BoxDecoration(
                  color: const Color(0xFFFFFAF2),
                  borderRadius: BorderRadius.circular(16),
                  border: Border.all(color: Colors.brown),
                  boxShadow: [
                    BoxShadow(
                      color: Colors.black.withOpacity(0.15),
                      blurRadius: 15,
                      offset: const Offset(5, 5),
                    )
                  ],
                ),
                child: Container(
                  padding: const EdgeInsets.all(16),
                  decoration: BoxDecoration(
                    borderRadius: BorderRadius.circular(16),
                    border: Border.all(color: const Color(0xFFE9E5DC), width: 1),
                  ),
                  child: RawScrollbar(
                    controller: _scrollController,
                    thumbVisibility: true,
                    thickness: 5.0,
                    radius: const Radius.circular(5.0),
                    thumbColor: Colors.brown.shade400,
                    minThumbLength: 50,
                    child: SingleChildScrollView(
                      controller: _scrollController,
                      child: Column(
                        children: [
                          Text(
                            'Alamu Swalath',
                            style: GoogleFonts.anekMalayalam(
                              fontSize: 28,
                              fontWeight: FontWeight.bold,
                              color: Colors.blue.shade900,
                            ),
                            textAlign: TextAlign.center,
                          ),
                          const SizedBox(height: 24),
                          Text(
                            arabicText,
                            textDirection: TextDirection.rtl,
                            textAlign: TextAlign.justify,
                            style: GoogleFonts.amiri(
                              fontSize: 24,
                              height: 2.0,
                              color: Colors.black87,
                            ),
                          ),
                        ],
                      ),
                    ),
                  ),
                ),
              ),
            ),
          ),
        ),
      ),
    );
  }

  @override
  void dispose() {
    _scrollController.dispose();
    super.dispose();
  }
}