import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';

class HizbAlnawawiScreen extends StatefulWidget {
  const HizbAlnawawiScreen({super.key});

  @override
  State<HizbAlnawawiScreen> createState() => _HizbAlnawawiScreenState();
}

class _HizbAlnawawiScreenState extends State<HizbAlnawawiScreen> {
  final ScrollController _scrollController = ScrollController();
  
  final String arabicText = 'بِسْمِ اللهِ اللهُ أَكْبَرُ ، اللهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، أَقُولُ عَلَى نَفْسِي وَعَلَى دِينِي، وَعَلَى أَهْلِي وَعَلَى أَوْلَادِي، وَعَلَى مَالِي وَعَلَى أَصْحَابِي، وَعَلَى أَدْيَانِهِمْ وَعَلَى أَمْوَالِهِمْ أَلْفَ بِسْمِ اللهِ اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللهُ أَكْبَرُ، أَقُولُ عَلَى نَفْسِي وَعَلَى دِينِي، وَعَلَى أَهْلِي وَعَلَى أَوْلَادِي، وَعَلَى مَالِي وَعَلَى أَصْحَابِي، وَعَلَى أَدْيَانِهِمْ وَعَلَى أَمْوَالِهِمْ، أَلْفَ أَلْفِ بِسْمِ اللهِ اللهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، أَقُولُ عَلَى نَفْسِي وَعَلَى دِينِي، وَعَلَى أَهْلِي وَعَلَى أَوْلَادِي وَعَلَى مَالِي وَعَلَى أَصْحَابِي وَعَلَى أَدْيَانِهِمْ وَعَلَى أَمْوَالِهِمْ أَلْفَ أَلْفِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ العَلِيِّ العَظِيمِ. بِسْمِ اللَّهِ وَبِاللَّهِ وَمِنَ اللَّهِ وَإِلَى اللَّهِ وَعَلَى اللهِ وَفِي اللهِ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ العَلِيِّ العَظِيمِ، بِسْمِ اللَّهِ عَلَى دِينِي وَعَلَى نَفْسِي وَعَلَى أَوْلَادِي، بِسْمِ اللهِ عَلَى مَالِي وَعَلَى أَهْلِي، بِسْمِ اللَّهِ عَلَى كُلِّ شَيْءٍ أَعْطَانِيهِ رَبِّي، بِسْمِ اللَّهِ رَبِّ السَّمَوَاتِ السَّبْعِ وَرَبِّ الْأَرَضِينَ السَّبْعِ وَرَبِّ العَرْشِ العَظِيمِ. بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ العَلِيمُ (ثَلَاثًا). بِسْمِ اللهِ خَيْرِ الْأَسْمَاءِ فِي الْأَرْضِ وَفِي السَّمَاءِ، بِسْمِ اللهِ أَفْتَتِحُ وَبِهِ أَخْتَتِمُ اللَّهُ اللَّهُ اللَّهُ اللَّهُ رَبِّي لَا أُشْرِكُ بِهِ شَيْئًا، اللهُ اللهُ اللهُ اللهُ رَبِّي لَا إِلَهَ إِلَّا اللَّهُ اللَّهُ أَعَزُّ وَأَجَلُّ وَأَكْبَرُ مِمَّا أَخَافُ وَأَحْذَرُ بِكَ اللَّهُمَّ أَعُوذُ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ غَيْرِي، وَمِنْ شَرِّ مَا خَلَقَ رَبِّي وَذَرَأَ وَبَرَأَ، وَبِكَ اللَّهُمَّ أَحْتَرِزُ مِنْهُمْ، وَبِكَ اللَّهُمَّ أَعُوذُ مِنْ شُرُورِهِمْ، وَبِكَ اللَّهُمَّ أَدْرَأُ فِي تُحُورِهِمْ، وَأُقَدِّمُ بَيْنَ يَدَيَّ وَأَيْدِيهِمْ: بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ قُلْ هُوَ اللَّهُ أَحَدٌ (١) اللَّهُ الصَّمَدُ (٢) لَمْ يَلِدْ وَلَمْ يُولَدْ (٣) وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ (٤) (ثَلَاثًا). وَمِثْلُ ذَلِكَ عَنْ يَمِينِي وَعَنْ أَيْمَانِهِمْ، وَمِثْلُ ذَلِكَ عَنْ شِمَالِي وَعَنْ شَمَائِلِهِمْ، وَمِثْلُ ذَلِكَ أَمَامِي وَأَمَامِهِمْ، وَمِثْلُ ذَلِكَ مِنْ خَلْفِي وَمِنْ خَلْفِهِمْ، وَمِثْلُ ذَلِكَ مِنْ فَوْقِي وَمِنْ فَوْقِهِمْ، وَمِثْلُ ذَلِكَ مِنْ تَحْتِي وَمِنْ تَحْتِهِمْ، وَمِثْلُ ذَلِكَ مُحِيطٌ بِي وَبِهِمْ اللَّهُمَّ إِنِّي أَسْأَلُكَ لِي وَلَهُمْ مِنْ خَيْرِكَ بِخَيْرِكَ الَّذِي لَا يَمْلِكُهُ غَيْرُكَ، اللَّهُمَّ اجْعَلْنِي وَإِيَّاهُمْ فِي عِبَادِكَ وَعِيَاذِكَ وَعِيَالِكَ وَجِوَارِكَ وَأَمَانِكَ وَحِزْبِكَ وَحِرْزِكَ وَكَنَفِكَ مِنْ شَرِّ كُلِّ شَيْطَانٍ وَسُلْطَانٍ وَإِنْسٍ وَجَانَّ وَبَاغِ وَحَاسِدٍ وَسَبْعِ وَحَيَّةٍ وَعَقْرَبٍ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذُ بِنَاصِيَتِهَا إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ حَسْبِيَ الرَّبُ مِنَ المَرْبُوبِينَ، حَسْبِيَ الخَالِقُ مِنَ المَخْلُوقِينَ، حَسْبِيَ الرَّازِقُ مِنَ المَرْزُوقِينَ، حَسْبِيَ السَّاتِرُ مِنَ المَسْتُورِينَ، حَسْبِيَ النَّاصِرُ مِنَ المَنْصُورِينَ حَسْبِيَ القَاهِرُ مِنَ المَقْهُورِينَ، حَسْبِي الَّذِي هُوَ حَسْبِي حَسْبِي مَنْ لَمْ يَزَلْ حَسْبِي، حَسْبِي اللَّهُ وَنِعْمَ الوَكِيلُ، حَسْبِي اللهُ مِنْ جَمِيعِ خَلْقِهِ. إِنَّ ولَيَ اللَّهُ الَّذِي نَزَّلَ الكِتابَ وَهُوَ يَتَوَلَّى الصَّالِحِينَ، وَإِذَا قَرَأْتَ القُرْءانَ جَعَلْنَا بَيْنَكَ وَبَيْنَ الَّذِينَ لَا يُؤْمِنُونَ بِالآخِرَةِ حِجَاباً مستوراً، وَجَعَلْنَا عَلَى قُلُوبِهِمْ أَكِنَّةً أَنْ يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْراً، وَإِذا ذَكَرْتَ رَبَّكَ فِي القُرْءانِ وَحْدَهُ وَلَّوْا عَلَى أَدْبَارِهِمْ نُفُوراً. (فَإِنْ تَوَلَّوْا فَقُلْ حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ) (سبعاً). وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ العَلِيِّ العَظِيمِ (ثَلَاثَاً) وَصَلَّى اللهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلَّمَ، ) ثُمَّ يَنْفُثُ عَنْ يَمِينِهِ ثَلَاثَاً وعَنْ يَسَارِهِ ثَلَاثَاً وَأَمَامَهُ ثَلَاثَاً وَخَلْفَهُ ثَلَاثَاً ) خَبَّأْتُ نَفْسِي فِي خَزَائِنِ بِسْمِ اللَّهِ، أَقْفَالُهَا ثِقَتِي بِاللَّهِ، مَفَاتِيحُهَا لَا قُوَّةَ إِلَّا بِاللَّهِ، أُدَافِعُ بِكَ اللَّهُمَّ عَنْ نَفْسِي مَا أُطِيقُ وَمَا لَا أُطِيقُ، لَا طَاقَةَ لِمَخْلُوقٍ مَعَ قُدْرَةِ الخَالِقِ، حَسْبِيَ اللهُ وَنِعْمَ الوَكِيلُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ العَلِيِّ العَظِيمِ. وَصَلَّى اللهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلَّمَ. (ثَلَاثًا)';

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: const Color(0xFFF8F3E3),
      body: NestedScrollView(
        controller: _scrollController,
        headerSliverBuilder: (BuildContext context, bool innerBoxIsScrolled) {
          return [
            SliverAppBar(
              backgroundColor: const Color(0xFFF8F3E3),
              elevation: 0,
              floating: true,
              snap: false,
              pinned: false,
              expandedHeight: 30,
              collapsedHeight: 30,
              toolbarHeight: 30,
              leading: IconButton(
                icon: const Icon(Icons.arrow_back, color: Colors.brown),
                onPressed: () => Navigator.of(context).pop(),
              ),
            ),
          ];
        },
        body: SafeArea(
          child: Padding(
            padding: const EdgeInsets.all(6),
            child: Container(
              decoration: BoxDecoration(
                color: const Color(0xFFFFFAF2),
                borderRadius: BorderRadius.circular(16),
                border: Border.all(color: Colors.brown),
                boxShadow: [
                  BoxShadow(
                    color: Colors.black.withOpacity(0.15),
                    blurRadius: 15,
                    offset: const Offset(5, 5),
                  )
                ],
              ),
              child: Container(
                padding: const EdgeInsets.all(16),
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(16),
                  border: Border.all(color: const Color(0xFFE9E5DC), width: 1),
                ),
                child: RawScrollbar(
                  controller: _scrollController,
                  thumbVisibility: true,
                  thickness: 5.0,
                  radius: const Radius.circular(5.0),
                  thumbColor: Colors.brown.shade400,
                  minThumbLength: 50,
                  child: SingleChildScrollView(
                    controller: _scrollController,
                    child: Column(
                      children: [
                        Text(
                          'حزب النووي',
                          style: GoogleFonts.amiri(
                            fontSize: 28,
                            fontWeight: FontWeight.bold,
                            color: Colors.blue.shade900,
                          ),
                          textAlign: TextAlign.center,
                        ),
                        const SizedBox(height: 24),
                        Text(
                          arabicText,
                          textDirection: TextDirection.rtl,
                          textAlign: TextAlign.justify,
                          style: GoogleFonts.amiriQuran(
                            fontSize: 22,
                            height: 2.0,
                            color: Colors.black87,
                          ),
                        ),
                      ],
                    ),
                  ),
                ),
              ),
            ),
          ),
        ),
      ),
    );
  }

  @override
  void dispose() {
    _scrollController.dispose();
    super.dispose();
  }
}
