import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';

class KanzulArshScreen extends StatefulWidget {
  const KanzulArshScreen({super.key});

  @override
  State<KanzulArshScreen> createState() => _KanzulArshScreenState();
}

class _KanzulArshScreenState extends State<KanzulArshScreen> {
  final ScrollController _scrollController = ScrollController();
  
final String arabicText = 'لاَ إِلَهَ إلا اللهُ سُبْحَانَ الْمَلِكِ الْقُدُوسِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْعَزِيزِ الجَبَّارِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الرَّؤُوفِ الرَّحِيمِ ۞ لَا إِلَهَ إِلَّا اللهُ سُبْحَانَ الْغَفُورِ الْحَلِيمِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْكَرِيمِ الْحَلِيمِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْقَوِيِّ الْوَفِي ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ اللَّطِيفِ الْخَبِيرِ ۞ لَا إِلَهَ إِلَّا اللهُ سُبْحَانَ الصَّمَدِ الْمَعْبُودِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْغَفُورِ الْوَدُودِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْوَكِيلِ الْكَفِيلِ ۞ لَا إِلَهَ إِلَّا اللهُ سُبْحَانَ الرَّقِيبِ الْحَفِيظِ ۞ لَا إلَهَ إِلَّا اللَّهُ سُبْحَانَ الدَّائِمِ الْقَائِمِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْمُحْيِ الْمُمِيتِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْعَلِيمِ الْعَلَام ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الشَّافِي الْكَافِي ۞ لَا إِلَهَ إِلَّا اللهُ سُبْحَانَ الْعَظِيمِ الْبَاقِي ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الصَّمَدِ الْأَحَدِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ رَبِّ السَّمَاوَاتِ وَالْأَرْضِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ خَالِقِ الْمَخْلُوقَاتِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ مَنْ خَلَقَ اللَّيْلَ والنَّهَارَ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْفَتَاحِ الْعَلِيمِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْخَالِقِ الْبَارِيُّ الرَّازِقِ ۞ لا إِلَهَ إِلَّا اللهُ سُبْحَانَ الْعَزِيزِ الغَنِي ۞ لا إِلَهَ إِلَّا اللهُ سُبْحَانَ الْغَفُورِ الْشَّكُورِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْعَظِيمِ الْأَعْظَمِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ ذِي الْمُلْكِ وَالْمَلَكُوتِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ ذِي العِزَّةِ والْعَظَمَةِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ ذِي الْهَيْبَةِ وَالْقُدْرَةِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ ذِي الْكِبْرِيَاءِ وَالْجَبَرُوتِ ۞ لَا إِلَهَ إِلَّا اللهُ سُبْحَانَ السَّتَارِ الْعَظِيمِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ عَالِمِ الْغَيْبِ وَالْشَّهَادَةِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْحَمِيدِ الْمَجِيدِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْحَكِيمِ الْعَلِيمِ ۞ لَا إِلَهَ إِلَّا اللهُ سُبْحَانَ الْقَادِرِ الْغَفَّارِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ السَّمِيعِ الْعَلِيمِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ مَنْ هُوَ الرَّحْمَنُ الرَّحِيمُ ۞ لَا إِلَهَ إِلَّا اللهُ سُبْحَانَ الْمَلِكِ الْقُدُوسِ السَّلَامِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْمُؤْمِنِ الْمُهَيْمِنِ الْعَلَامِ الْمُتَعَالِي ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْبَرِّ التَّوَابِ الْمُنْتَقِمِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْعَفُقِ الرَّؤُوفِ الرَّحِيمِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ مَالِكِ الْمُلْكِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ ذِي الْجَلَالِ وَالْإِكْرَامِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْمُقْسِطِ الْجَامِعِ ۞ لَا إِلَهَ إِلَّا اللهُ سُبْحَانَ الْغَنِي الْمُغْنِي ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْمُعْطِي الْمَانِعِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الضَّارِ النَّافِعِ النُّورِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْهَادِي الْبَدِيعِ الْبَاقِي ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْوَارِثِ الرَّشِيدِ الصَّبُورِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْحَكِيمِ الْقَدِيمِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْقَادِرِ السَّتَارِ ۞ لَا إِلَهَ إِلَّا اللهُ سُبْحَانَ السَّمِيعِ الْبَصِيرِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الغَنِي العَظِيمِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْعَلَامِ السَّلَامِ ۞ لَا إِلَهَ إِلَّا اللهُ سُبْحَانَ الْمَلِكِ النَّصِيرِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْغَنِي الرَّحْمَنِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْقَرِيبِ الْمُجِيبِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ وَلِي الْحَسَنَاتِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الصَّبُورِ السَّتَارِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ خَالِقِ النُّورِ وَالنِّيَاءِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْغَنِي الْمُعْجِزِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الفَاضِلِ الشَّكُورِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْغَنِي القَدِيمِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ ذِي الْجَلَالِ الْمُبِينِ  لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْخَالِصِ الْمُخْلِصِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الصَّادِقِ الْوَعْدِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْمَلِكِ الْحَقِّ الْمُبِينِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْقَوِيِّ الْعَزِيزِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ مَنْ لَا يَمُوتُ وَلَا يَفُوتُ أَبَدًا ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْحَيِّ الْقَيُّومِ الَّذِي لَا يَمُوتُ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ قَابِلِ التَّوْبِ شَدِيدِ الْعِقَابِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْقَدِيمِ مِنْ كُلِّ شَيْءٍ وَبَعْدَ كُلِّ شَيْءٍ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْخَالِقِ الْبَارِئِ الْمُصَوِّرِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْفَرْدِ الْصَّمَدِ الْمُدَبِّرِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ مَنْ كُلِّ شَيْءٍ هَالِكَ إِلَّا وَجْهَهُ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ مَالِكِ يَوْمِ الدِّينِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْعَلَامِ الْغُيُوبِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ السَّتَارِ الْعُيُوبِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ غَفَّارِ الذُّنُوبِ  لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ غَافِرِ الذُّنُوبِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْغَفَّارِ الْمُسْتَعَانِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْحَنَّانِ الْمَنَانِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ رَبِّ الْعَالَمِينَ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْبَاعِثِ الْوَارِثِ الْوَهَّابِ ۞ لَا إِلَهَ إلا اللهُ سُبْحَانَ الْعَدْلِ الْمُؤْمِنِ الْمُهَيْمِنِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ السُّلْطَانِ الْبَاسِطِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْوَلِيِّ الْمُحْصَى الْمُبْدِئِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الوَاجِدِ الْمَاجِدِ التَّوَّابِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْمُنْتَقِمِ الْمُنْعِمِ الْعَفْوَ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْمُقَدِّرِ الْقَادِرِ الْمُقْتَدِرِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْحَبِيبِ الْمُقِيتِ الْحَفِيظِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْحَافِظِ النَّاصِرِ الْقَاهِرِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْهَادِي الْبَدِيعِ البَاقِي ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْقَابِضِ الرَّافِعِ الْخَافِضِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ النُّورِ الْمُقْسِطِ الْجَامِعِ ۞ لَا إِلَهَ إِلَّا اللهُ سُبْحَانَ الْمَانِعِ الضَّارِ النَّافِعِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْأَجْوَدِ الْمُقَدِّمِ الْوَاسِعِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الرَّاحِمِ الرَّحْمَنِ السَّتَارِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْمَالِكِ الرَّحِيمِ الْغَفَّارِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْحَلِيمِ الرَّؤُوفِ الْوَهَّابِ ۞ لَا إِلَهَ إلَّا اللهُ سُبْحَانَ الْجَابِرِ الْكَاشِفِ الْكُرُوبِ ۞ لَا إِلَهَ إِلَّا اللهُ سُبْحَانَ ذِي الْكَرَمِ الْوَاهِبِ الْعَطِيَّاتِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الشَّدِيدِ الْعِقَابِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ غَافِرِ الذُّنُوبِ والْخَطِيئَاتِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ ذِي الْغُفْرَانِ الْمَالِكِ الْمُلْكِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْجَلِيلِ الْجَبَّارِ الْمُتَكَبِّرِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ رَبِّ الْمَلَائِكَةِ وَالرُّوحِ ۞ لَا إِلَهَ إِلَّا اللهُ سُبْحَانَ ذِي الْآلَاءِ وَالنِّعْمَاءِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْمَقْصُودِ الْمَوْجُودِ ۞ لَا إِلَهَ إِلَّا اللَّهُ سُبْحَانَ الْحَقِّ النَّاصِرِ المُعِينِ ۞ لَا إِلَهَ إِلَّا اللهُ آدَمُ صَفِي اللَّهِ ۞ لَا إِلَهَ إِلَّا اللَّهُ نُوحٌ نَجِيَّ اللَّهِ ۞ لَا إِلَهَ إِلَّا اللَّهُ إِبْرَاهِيمُ خَلِيلُ اللَّهِ ۞ لَا إِلَهَ إِلَّا اللَّهُ إِسْمَاعِيلُ ذَبِيحُ اللَّهِ ۞ لَا إِلَهَ إِلَّا اللَّهُ مُوسَى كَلِيمُ اللَّهِ ۞ لَا إِلَهَ إِلَّا اللهُ دَاوُدُ خَلِيفَةُ اللَّهِ ۞ لَا إِلَهَ إِلَّا اللهُ عِيسَى رُوحُ اللَّهِ ۞ لَا إِلَهَ إِلَّا اللَّهُ مُحَمَّدٌ رَسُولُ اللَّهِ صَلَّى اللهُ وَسَلَّمَ عَلَى خَيْرٍ خَلْقِهِ وَنُورِ عَرْشِهِ أَفْضَلِ الْأَنْبِيَاءِ والْمُرْسَلِينَ وَحَبِيبِ رَبِّ الْعَالَمِينَ حَبِيبِنَا وَشَفِيعِنَا وَسَيِّدِنَا وَمَوْلَانَا وَوَسِيلَتِنَا إِلَى اللَّهِ مُحَمَّدٍ وَآلِهِ وَصَحْبِهِ أَجْمَعِينَ ۞  ';


  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: const Color(0xFFF8F3E3),
      body: NestedScrollView(
        controller: _scrollController,
        headerSliverBuilder: (BuildContext context, bool innerBoxIsScrolled) {
          return [
            SliverAppBar(
              backgroundColor: const Color(0xFFF8F3E3),
              elevation: 0,
              floating: true,
              snap: false,
              pinned: false,
              expandedHeight: 30,
              collapsedHeight: 30,
              toolbarHeight: 30,
              leading: IconButton(
                icon: const Icon(Icons.arrow_back, color: Colors.black),
                onPressed: () => Navigator.of(context).pop(),
              ),
            ),
          ];
        },
        body: SafeArea(
          child: Padding(
            padding: const EdgeInsets.all(6),
            child: Container(
              decoration: BoxDecoration(
                color: const Color(0xFFFFFAF2),
                borderRadius: BorderRadius.circular(16),
                border: Border.all(color: Colors.brown),
                boxShadow: [
                  BoxShadow(
                    color: Colors.black.withOpacity(0.15),
                    blurRadius: 15,
                    offset: const Offset(5, 5),
                  )
                ],
              ),
              child: Container(
                padding: const EdgeInsets.all(16),
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(16),
                  border: Border.all(color: const Color(0xFFE9E5DC), width: 1),
                ),
                child: RawScrollbar(
                  controller: _scrollController,
                  thumbVisibility: true,
                  thickness: 5.0,
                  radius: const Radius.circular(5.0),
                  thumbColor: Colors.brown.shade400,
                  minThumbLength: 50,
                  child: SingleChildScrollView(
                    controller: _scrollController,
                    child: Column(
                      children: [
                        Text(
                          'Kanzul Arsh',
                          style: GoogleFonts.amiri(
                            fontSize: 28,
                            fontWeight: FontWeight.bold,
                            color: Colors.blue.shade900,
                          ),
                          textAlign: TextAlign.center,
                        ),
                        const SizedBox(height: 24),
                        Text(
                          arabicText,
                          textDirection: TextDirection.rtl,
                          textAlign: TextAlign.justify,
                          style: GoogleFonts.amiriQuran(
                            fontSize: 22,
                            height: 2.0,
                            color: Colors.black87,
                          ),
                        ),
                      ],
                    ),
                  ),
                ),
              ),
            ),
          ),
        ),
      ),
    );
  }

  @override
  void dispose() {
    _scrollController.dispose();
    super.dispose();
  }
}
